{
    "Background": "After a long journey by ship, you finally reach the coordinates where the uncharted island is supposed to be. Upon arrival, you are greeted by an untouched piece of paradise filled with luscious greenery, an habitat for unknown species. You spend the next days documenting the new flora and fauna, discovering a few species unrecorded by science.",
    "Scene 1": "While exploring, you encounter a strange insect unlike anything you've ever seen - it appears to glow and hum whenever you get closer.",
    "Choice 1": "Will you attempt to catch the insect?",
    "Scene 2": "Catching the glowing insect without hurting it is tricky, but you manage. You realize its glow intensifies in a certain direction, like a compass.",
    "Choice 2": "Do you follow the insect's glowing direction?",
    "Scene 3": "Deciding against capturing the insect, you watch it fly away towards unexplored terrain. Something feels odd about the way it moved.",
    "Choice 3": "Do you follow the insect?",
    "Scene 4": "Following the glow, you discover a cave entrance hidden behind verdant vines, seemingly untouched by time.",
    "Choice 4": "Do you enter the cave?",
    "Scene 5": "You ignore the glow and continue your exploration elsewhere, soon stumbling upon a crystal-clear freshwater stream.",
    "Choice 5": "Do you follow the stream?",
    "Scene 6": "You decide not to follow the insect's direction and steer yourself towards a looming mountain range in the distance.",
    "Choice 6": "Do you attempt to climb the mountain?",
    "Scene 7": "Despite not following the strange insect, you stumble upon a mysterious, ancient-looking monument.",
    "Choice 7": "Do you approach and investigate the monument?",
    "Scene 8": "The cave isn't big but on a wall there's an ancient mural depicting a map with different symbols.",
    "Choice 8": "Do you try to decipher the symbols?",
    "Scene 9": "Choosing not to enter the cave, you wander around it until you find an entrance to a secret underwater tunnel.",
    "Choice 9": "Do you dive to explore the tunnel?",
    "Scene 10": "Following the stream, you find it expands into a beautiful waterfall with a hidden path behind it.",
    "Choice 10": "Do you follow that hidden path?",
    "Scene 11": "You decide to not follow the stream and head back towards the beach where you discover a beached shipwreck.",
    "Choice 11": "Do you explore the shipwreck?",
    "Scene 12": "Having decided to climb the mountain, you find an abandoned hut about halfway to the peak.",
    "Choice 12": "Do you inspect the hut?",
    "Scene 13": "Choosing not to climb, you instead find a lush valley full of exotic fruits, some you've never seen before.",
    "Choice 13": "Do you try some of these unfamiliar fruits?",
    "Scene 14": "Despite your slight apprehension, you approach the monument, noticing intricate markings on the stone.",
    "Choice 14": "Do you touch the monument?",
    "Scene 15": "You decide to leave the monument untouched and notice a narrow but well-trodden path leading into the dense jungle.",
    "Choice 15": "Do you venture into the jungle?",
    "Scene 16": "Deciphering the symbols, you realize they form a riddle pointing to a hidden path outside the cave.",
    "Choice 16": "Do you follow this hidden path?",
    "Scene 17": "Unable to decipher the symbols, you figure out they may be a complex code and decide to make an accurate sketch of it.",
    "Choice 17": "Do you take a rubbing of the symbols for later analysis?",
    "Scene 18": "The underwater tunnel leads you to a hidden grotto full of luminescent flora.",
    "Choice 18": "Do you attempt to collect samples of the luminous flora?",
    "Scene 19": "Feeling claustrophobic and out of breath, you decide against exploring the tunnel and swim back to shore, finding dropped tools around the area.",
    "Choice 19": "Do you pick up the tools?",
    "Scene 20": "Following the hidden path, you discover a large and pristine lake in the heart of the island.",
    "Choice 20": "Do you swim to the center of the lake?",
    "Scene 21": "Following the waterfall too intently, you slipped into the water and swam to the other side, only to find an old hermit living there.",
    "Choice 21": "Do you approach the old hermit?",
    "Scene 22": "The shipwreck seems abandoned for decades, but it could contain valuable clues about previous explorers.",
    "Choice 22": "Do you enter the shipwreck?",
    "Scene 23": "You choose to avoid the shipwreck and continue along the beach where you spot a secluded cave.",
    "Choice 23": "Do you enter the cave?",
    "Scene 24": "The hut has been abandoned for some time now. Inside, you find a diary belonging to an explorer named 'Dalton'.",
    "Choice 24": "Do you read Dalton's diary entries?",
    "Scene 25": "Choosing not to inspect the hut, you instead continued up the steep slopes, discovering a plateau with a clear view of the island.",
    "Choice 25": "Do you decide to camp out on the plateau?",
    "Scene 26": "Sampling the unknown fruit gives you energy and increased perception. The prints of a massive creature are apparent nearby.",
    "Choice 26": "Do you follow the creature's prints?",
    "Scene 27": "You decide not to eat the strange fruits and instead spot a peculiar rock formation from the corner of your eye.",
    "Choice 27": "Do you explore the formation?",
    "Scene 28": "Touching the monument, you feel a strange sensation and faint buzzing sound. Suddenly, a hidden door in the monument opens.",
    "Choice 28": "Do you enter the hidden door?",
    "Scene 29": "Despite your urge to touch, you refrain and go around the monument, where you find an old musket half-buried in the ground.",
    "Choice 29": "Do you dig up the old musket?",
    "Scene 30": "Venturing into the dense jungle along the path, you discover a hidden village inhabited by a tribe unknown to civilization.",
    "Choice 30": "Do you approach the village?",
    "Scene 31": "You avoid the path into the jungle, which leads you to the top of a hill where a pack of rare snow-white wolves dwell.",
    "Choice 31": "Do you attempt to interact with the wolves?"
}